### Questions for Part 2: Data Manipulation with Pandas

22. What is the difference between `loc` and `iloc` in Pandas?
23. How do you set a specific column as the index of a DataFrame?
24. How can you concatenate two DataFrames vertically?
25. How would you apply a custom function to a column in a DataFrame?

1. What are the primary functions of Pandas?

Pandas primary functions are data manipulation and analysis through the use of two powerful data structures: Series and DataFrame.

2. How can you select a specific column from a DataFrame?

In [1]:
import pandas as pd

df = pd.read_csv(
    "/workspaces/DScourse/CourseMaterials/Data/sberbank_russian_housing_market/macro.csv"
)

df.head(3)

,timestamp,oil_urals,gdp_quart,gdp_quart_growth,cpi,ppi,gdp_deflator,balance_trade,balance_trade_growth,usdrub,...,provision_retail_space_modern_sqm,turnover_catering_per_cap,theaters_viewers_per_1000_cap,seats_theather_rfmin_per_100000_cap,museum_visitis_per_100_cap,bandwidth_sports,population_reg_sports_share,students_reg_sports_share,apartment_build,apartment_fund_sqm
0,2010-01-01,76.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,690.0,6221.0,527.0,0.41,993.0,NaN,NaN,63.03,22825.0,NaN
1,2010-01-02,76.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,690.0,6221.0,527.0,0.41,993.0,NaN,NaN,63.03,22825.0,NaN
2,2010-01-03,76.1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,690.0,6221.0,527.0,0.41,993.0,NaN,NaN,63.03,22825.0,NaN

In [2]:
df["apartment_build"]

0       22825.0
1       22825.0
2       22825.0
3       22825.0
4       22825.0
         ...
2479        NaN
2480        NaN
2481        NaN
2482        NaN
2483        NaN
Name: apartment_build, Length: 2484, dtype: float64

3. How would you select rows from a DataFrame based on a condition?

In [3]:
df[df["oil_urals"] > 76.1]

,timestamp,oil_urals,gdp_quart,gdp_quart_growth,cpi,ppi,gdp_deflator,balance_trade,balance_trade_growth,usdrub,...,provision_retail_space_modern_sqm,turnover_catering_per_cap,theaters_viewers_per_1000_cap,seats_theather_rfmin_per_100000_cap,museum_visitis_per_100_cap,bandwidth_sports,population_reg_sports_share,students_reg_sports_share,apartment_build,apartment_fund_sqm
59,2010-03-01,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.9635,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
60,2010-03-02,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.8530,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
61,2010-03-03,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.7630,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
62,2010-03-04,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.8660,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
63,2010-03-05,77.0300,NaN,NaN,317.7,343.9,NaN,16.704,NaN,29.7916,...,690.0,6221.0,527.0,0.41000,993.0,NaN,NaN,63.03,22825.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1790,2014-11-26,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,47.0581,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1791,2014-11-27,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,48.5826,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1792,2014-11-28,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,49.4670,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1793,2014-11-29,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,49.4670,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8
1794,2014-11-30,78.9665,20406.9,0.9,434.9,512.5,113.465,16.540,7.2,49.4670,...,NaN,10311.0,NaN,0.44784,NaN,398451.0,28.2,NaN,46080.0,229294.8

4. What function would you use to calculate the average of a column in a DataFrame?

In [4]:
df["oil_urals"].mean()

86.46715680354266

5. How can you add a new column to an existing DataFrame?

In [5]:
people = [
    {"name": "John", "age": 26, "city": "New York", "occupation": "policeman"},
    {"name": "Bob", "age": 45, "city": "Los Angeles", "occupation": "clerk"},
    {"name": "Jane", "age": 67, "city": "Boston", "occupation": "company CEO"},
    {"name": "Luke", "age": 19, "city": "New York", "occupation": "lifeguard"},
    {"name": "Amanda", "age": 55, "city": "Boston", "occupation": "businesswoman"},
]
my_df = pd.DataFrame(people, index=[1, 2, 3, 4, 5])
my_df

     name  age         city     occupation
1    John   26     New York      policeman
2     Bob   45  Los Angeles          clerk
3    Jane   67       Boston    company CEO
4    Luke   19     New York      lifeguard
5  Amanda   55       Boston  businesswoman

In [6]:
genders = ["male", "male", "female", "male", "female"]
my_df["gender"] = genders
my_df[["name", "age", "gender", "occupation", "city"]]

     name  age  gender     occupation         city
1    John   26    male      policeman     New York
2     Bob   45    male          clerk  Los Angeles
3    Jane   67  female    company CEO       Boston
4    Luke   19    male      lifeguard     New York
5  Amanda   55  female  businesswoman       Boston

In [7]:
del my_df["gender"]

In [8]:
my_df.insert(2, column="gender", value=genders)
my_df

     name  age  gender         city     occupation
1    John   26    male     New York      policeman
2     Bob   45    male  Los Angeles          clerk
3    Jane   67  female       Boston    company CEO
4    Luke   19    male     New York      lifeguard
5  Amanda   55  female       Boston  businesswoman

In [9]:
# assign method returns a new DataFrame object!
my_df.assign(gender=genders)
my_df[["name", "age", "gender", "occupation", "city"]]

     name  age  gender     occupation         city
1    John   26    male      policeman     New York
2     Bob   45    male          clerk  Los Angeles
3    Jane   67  female    company CEO       Boston
4    Luke   19    male      lifeguard     New York
5  Amanda   55  female  businesswoman       Boston

6. How do you modify the values of an existing column in a DataFrame?

In [10]:
from faker import Faker

fake = Faker()
last_names = [fake.last_name() for _ in range(5)]
last_names

['Hendricks', 'Norris', 'Allen', 'Stewart', 'Clark']

In [11]:
my_df["name"] = my_df["name"] + " " + last_names
my_df

             name  age  gender         city     occupation
1  John Hendricks   26    male     New York      policeman
2      Bob Norris   45    male  Los Angeles          clerk
3      Jane Allen   67  female       Boston    company CEO
4    Luke Stewart   19    male     New York      lifeguard
5    Amanda Clark   55  female       Boston  businesswoman

In [12]:
my_df["age"] += 10
my_df

             name  age  gender         city     occupation
1  John Hendricks   36    male     New York      policeman
2      Bob Norris   55    male  Los Angeles          clerk
3      Jane Allen   77  female       Boston    company CEO
4    Luke Stewart   29    male     New York      lifeguard
5    Amanda Clark   65  female       Boston  businesswoman

In [13]:
df["salary"].head()

0    38410.5
1    38410.5
2    38410.5
3    38410.5
4    38410.5
Name: salary, dtype: float64

In [14]:
df["salary"] = df["salary"].apply(lambda row: row**0.5)
df["salary"].head()

0    195.985969
1    195.985969
2    195.985969
3    195.985969
4    195.985969
Name: salary, dtype: float64

In [15]:
# Revert 'salary' column back
df["salary"] = df["salary"].apply(lambda row: row**2)
df["salary"].head()

0    38410.5
1    38410.5
2    38410.5
3    38410.5
4    38410.5
Name: salary, dtype: float64

7. What is the output of `df['Name']` given the provided DataFrame example?

The output of `df['name']` given the `my_df` DataFrame, for example, would be a Series object containing the data in the `name` column of `my_df`.

In [16]:
print(type(my_df["name"]))
my_df["name"]

<class 'pandas.core.series.Series'>

1    John Hendricks
2        Bob Norris
3        Jane Allen
4      Luke Stewart
5      Amanda Clark
Name: name, dtype: object

8. How would you select rows where the 'City' is 'New York'?

In [17]:
my_df[my_df["city"] == "New York"]

             name  age gender      city occupation
1  John Hendricks   36   male  New York  policeman
4    Luke Stewart   29   male  New York  lifeguard

9. What function can be used to count the number of non-NA/null values in a column?

In [18]:
print(f"The number of rows in df is {len(df)}")
# count the number of non-NA/null values in the 'gdp_quart' column
df["gdp_quart"].count()

The number of rows in df is 2484

2394

10. How can you filter rows in a DataFrame where 'Age' is less than 30?

In [19]:
my_df[my_df["age"] < 30]

           name  age gender      city occupation
4  Luke Stewart   29   male  New York  lifeguard

11. How do you aggregate data in Pandas?

In [48]:
names = [fake.name() for _ in range(10)]
ages = [fake.random.randint(18, 90) for _ in range(10)]
occupations = [fake.job() for _ in range(10)]
salaries = [fake.random.randint(6000.0, 40000.0) for _ in range(10)]
num_of_children = [fake.random.randint(0, 10) for _ in range(10)]
city_index = ["Boston", "New York", "Los Angeles", "Houston"]
cities = fake.random.choices(city_index, k=10)
BA_averages = [fake.random.randint(55.0, 100.0) for _ in range(10)]

students = pd.DataFrame(
    {
        "name": names,
        "age": ages,
        "number_of_children": num_of_children,
        "city": cities,
        "occupation": occupations,
        "BA_average": BA_averages,
        "salary": salaries,
    }
)

students

,name,age,number_of_children,city,occupation,BA_average,salary
0,Mario Coleman,52,3,Los Angeles,Advertising account planner,61,7081
1,Noah Bell,86,10,Houston,Applications developer,65,33167
2,Ronald Miller,38,8,Los Angeles,"Education officer, community",88,36278
3,Janet Harris MD,82,9,New York,Set designer,90,10566
4,Brian Ingram,62,4,New York,Therapeutic radiographer,88,15097
5,James Miller,84,5,Boston,Waste management officer,71,34805
6,Daniel Juarez,71,0,Los Angeles,"Teacher, primary school",78,26629
7,Robert Reid,65,1,New York,Sub,58,30728
8,Mark Johnson,35,10,Los Angeles,Museum/gallery conservator,72,22149
9,Tiffany Larsen,40,1,Houston,Museum education officer,64,37606

In [47]:
bins = [20, 30, 40, 50, 60, 70, 80, 90]
students.insert(2, column='age_range', 
                value=pd.cut(students['age'], 
                             bins=bins, 
                             right=False, 
                             include_lowest=True, 
                             labels=['20-29', '30-39', '40-49', '50-59', '60-69', '70-79', '80-89']
                          ))

students

,name,age,age_range,city,occupation,BA_average,salary
0,Kimberly Rodriguez,80,80-89,Houston,Site engineer,73,9541
1,Rebecca Bailey,82,80-89,Boston,Petroleum engineer,79,10711
2,Ryan Blevins,44,40-49,New York,"Engineer, petroleum",67,21657
3,Billy Day,50,50-59,Los Angeles,Equality and diversity officer,70,38895
4,Cristian Wood,20,20-29,Los Angeles,Retail banker,95,36949
5,Martin Miller,59,50-59,Boston,Actuary,99,22400
6,Heather Gallegos,73,70-79,Boston,Petroleum engineer,59,18958
7,Molly Freeman,30,30-39,Houston,Cabin crew,81,33641
8,Andre Singh,66,60-69,Houston,Herpetologist,80,39706
9,Michael Cohen,38,30-39,Houston,Chief of Staff,78,33521

In [22]:
city_age_range_grouped = students.groupby(['city', 'age_range'], observed=True)
city_age_range_grouped['salary'].mean()

city         age_range
Boston       40-49        25556.0
             50-59        29699.0
             60-69        18253.0
             80-89        19725.0
Houston      20-29        23111.0
             70-79        34652.0
Los Angeles  20-29        30373.0
             60-69        34525.0
             70-79        11220.0
             80-89        16980.0
Name: salary, dtype: float64

In [23]:
city_age_range_grouped['number_of_children'].mean()

city         age_range
Boston       40-49         1.0
             50-59         7.0
             60-69         7.0
             80-89        10.0
Houston      20-29         0.0
             70-79         4.0
Los Angeles  20-29         7.0
             60-69        10.0
             70-79         7.0
             80-89         3.0
Name: number_of_children, dtype: float64

In [24]:
city_grouped = students.groupby('city', observed=True)
city_grouped['number_of_children'].mean()

city
Boston         6.25
Houston        2.00
Los Angeles    6.75
Name: number_of_children, dtype: float64

In [25]:
print(city_grouped['number_of_children'].max())
print(city_grouped['number_of_children'].min())
print(city_grouped['number_of_children'].describe())

city
Boston         10
Houston         4
Los Angeles    10
Name: number_of_children, dtype: int64
city
Boston         1
Houston        0
Los Angeles    3
Name: number_of_children, dtype: int64
             count  mean       std  min  25%  50%   75%   max
city
Boston         4.0  6.25  3.774917  1.0  5.5  7.0  7.75  10.0
Houston        2.0  2.00  2.828427  0.0  1.0  2.0  3.00   4.0
Los Angeles    4.0  6.75  2.872281  3.0  6.0  7.0  7.75  10.0

12. What is the result of `df['Age'].sum()` given the provided DataFrame example?

The result is a sum of all the ages in the `age` column.

In [26]:
students['age'].sum()

585

13. How can you rename a column in a DataFrame?

Yes. There are several options. I will use the `rename` method.

In [27]:
# No use of the `inplace` parameter to preserve the original df
students.rename(columns={'name': 'full_name'}).head(3)

,full_name,age,age_range,number_of_children,city,occupation,BA_average,salary
0,Courtney Montes,80,80-89,10,Boston,Fitness centre manager,62,19725
1,Karen Banks,65,60-69,10,Los Angeles,Speech and language therapist,59,34525
2,Sheila Williams,72,70-79,7,Los Angeles,"Buyer, retail",96,11220

14. How do you select multiple columns from a DataFrame?

In [28]:
students[['name', 'age', 'salary']]

                  name  age  salary
0      Courtney Montes   80   19725
1          Karen Banks   65   34525
2      Sheila Williams   72   11220
3  Mrs. Lindsay Conner   76   34652
4       Carolyn Jordan   67   18253
5        Johnny Potter   42   25556
6   Michelle Gutierrez   23   23111
7           Erin Mejia   24   30373
8          Peter Lopez   50   29699
9    Matthew Frederick   86   16980

15. How would you filter rows based on multiple conditions, e.g., 'Age' greater than 25 and 'City' is 'San Francisco'?

In [39]:
students_filtered = students[(students['age'] > 50) & (students['city'] == 'Los Angeles')].reset_index(drop=True)
students_filtered.index = [1, 2, 3]
students_filtered

,name,age,city,occupation,BA_average,salary
1,Karen Banks,65,Los Angeles,Speech and language therapist,59,34525
2,Sheila Williams,72,Los Angeles,"Buyer, retail",96,11220
3,Matthew Frederick,86,Los Angeles,Colour technologist,82,16980

In [40]:
students_filtered = students.query("age > 50 and city == 'Los Angeles'")
students_filtered.index = [1, 2, 3]
students_filtered

,name,age,city,occupation,BA_average,salary
1,Karen Banks,65,Los Angeles,Speech and language therapist,59,34525
2,Sheila Williams,72,Los Angeles,"Buyer, retail",96,11220
3,Matthew Frederick,86,Los Angeles,Colour technologist,82,16980

In [41]:
students_filtered = students.loc[(students['age'] > 50) & (students['city'] == 'Los Angeles')]
students_filtered.index = [1, 2, 3]
students_filtered

,name,age,city,occupation,BA_average,salary
1,Karen Banks,65,Los Angeles,Speech and language therapist,59,34525
2,Sheila Williams,72,Los Angeles,"Buyer, retail",96,11220
3,Matthew Frederick,86,Los Angeles,Colour technologist,82,16980

16. What is the purpose of the `mean()` function in Pandas?

The `mean()` function or method in Pandas calculates the average of numerical values of some Series, be it an actual Series or a column in a DataFrame. It can calculate the average of each column in a DataFrame at once, provided it contains only numerical values.

In [32]:
age = pd.Series(ages)
print(age)
age.mean()

0    80
1    65
2    72
3    76
4    67
5    42
6    23
7    24
8    50
9    86
dtype: int64

58.5

In [33]:
numerical_df = students[['age', 'number_of_children', 'BA_average', 'salary']]
print(students['age'].mean(), end='\n\n')
print(numerical_df.mean())

58.5

age                      58.5
number_of_children        5.6
BA_average               76.1
salary                24409.4
dtype: float64

17. How can you delete a column from a DataFrame?

In [34]:
# No use of the `inplace` parameter to preserve the original df
students.drop('age_range', axis=1).head(3)

,name,age,number_of_children,city,occupation,BA_average,salary
0,Courtney Montes,80,10,Boston,Fitness centre manager,62,19725
1,Karen Banks,65,10,Los Angeles,Speech and language therapist,59,34525
2,Sheila Williams,72,7,Los Angeles,"Buyer, retail",96,11220

In [35]:
column_deleted = students.pop('age_range')
print(column_deleted)

0    80-89
1    60-69
2    70-79
3    70-79
4    60-69
5    40-49
6    20-29
7    20-29
8    50-59
9    80-89
Name: age_range, dtype: category
Categories (7, object): ['20-29' < '30-39' < '40-49' < '50-59' < '60-69' < '70-79' < '80-89']

In [49]:
del students['number_of_children']
students.head(3)

,name,age,city,occupation,BA_average,salary
0,Mario Coleman,52,Los Angeles,Advertising account planner,61,7081
1,Noah Bell,86,Houston,Applications developer,65,33167
2,Ronald Miller,38,Los Angeles,"Education officer, community",88,36278

18. How do you access the last row of a DataFrame?

In [51]:
students.iloc[-1]

name                    Tiffany Larsen
age                                 40
city                           Houston
occupation    Museum education officer
BA_average                          64
salary                           37606
Name: 9, dtype: object

In [52]:
students.tail(1)

             name  age     city                occupation  BA_average  salary
9  Tiffany Larsen   40  Houston  Museum education officer          64   37606

In [53]:
students.loc[students.index[-1]]

name                    Tiffany Larsen
age                                 40
city                           Houston
occupation    Museum education officer
BA_average                          64
salary                           37606
Name: 9, dtype: object

19. How can you reset the index of a DataFrame?

In [54]:
students_filtered.reset_index()

,index,name,age,city,occupation,BA_average,salary
0,1,Karen Banks,65,Los Angeles,Speech and language therapist,59,34525
1,2,Sheila Williams,72,Los Angeles,"Buyer, retail",96,11220
2,3,Matthew Frederick,86,Los Angeles,Colour technologist,82,16980

In [55]:
students_filtered.reset_index(drop=True)

,name,age,city,occupation,BA_average,salary
0,Karen Banks,65,Los Angeles,Speech and language therapist,59,34525
1,Sheila Williams,72,Los Angeles,"Buyer, retail",96,11220
2,Matthew Frederick,86,Los Angeles,Colour technologist,82,16980

In [60]:
students_filtered.reset_index().set_index('index')

,name,age,city,occupation,BA_average,salary
index,,,,,,
1,Karen Banks,65,Los Angeles,Speech and language therapist,59,34525
2,Sheila Williams,72,Los Angeles,"Buyer, retail",96,11220
3,Matthew Frederick,86,Los Angeles,Colour technologist,82,16980

20. How would you group data in a DataFrame based on a specific column?

In [71]:
city_grouped = students.groupby('city')
city_grouped.get_group('New York')

,name,age,city,occupation,BA_average,salary
3,Janet Harris MD,82,New York,Set designer,90,10566
4,Brian Ingram,62,New York,Therapeutic radiographer,88,15097
7,Robert Reid,65,New York,Sub,58,30728

In [79]:
city_grouped = students.groupby('city')
city_grouped_combined = pd.concat([city_grouped.get_group(city) for city in city_index])
city_grouped_combined.index = range(1, len(students) + 1)
city_grouped_combined

,name,age,city,occupation,BA_average,salary
1,James Miller,84,Boston,Waste management officer,71,34805
2,Janet Harris MD,82,New York,Set designer,90,10566
3,Brian Ingram,62,New York,Therapeutic radiographer,88,15097
4,Robert Reid,65,New York,Sub,58,30728
5,Mario Coleman,52,Los Angeles,Advertising account planner,61,7081
6,Ronald Miller,38,Los Angeles,"Education officer, community",88,36278
7,Daniel Juarez,71,Los Angeles,"Teacher, primary school",78,26629
8,Mark Johnson,35,Los Angeles,Museum/gallery conservator,72,22149
9,Noah Bell,86,Houston,Applications developer,65,33167
10,Tiffany Larsen,40,Houston,Museum education officer,64,37606

21. How can you sort a DataFrame based on a specific column?

In [83]:
students.sort_values(by='age', ascending=True).reset_index(drop=True)

,name,age,city,occupation,BA_average,salary
0,Mark Johnson,35,Los Angeles,Museum/gallery conservator,72,22149
1,Ronald Miller,38,Los Angeles,"Education officer, community",88,36278
2,Tiffany Larsen,40,Houston,Museum education officer,64,37606
3,Mario Coleman,52,Los Angeles,Advertising account planner,61,7081
4,Brian Ingram,62,New York,Therapeutic radiographer,88,15097
5,Robert Reid,65,New York,Sub,58,30728
6,Daniel Juarez,71,Los Angeles,"Teacher, primary school",78,26629
7,Janet Harris MD,82,New York,Set designer,90,10566
8,James Miller,84,Boston,Waste management officer,71,34805
9,Noah Bell,86,Houston,Applications developer,65,33167

In [85]:
students.sort_values(by=['BA_average', 'salary']).reset_index(drop=True)

,name,age,city,occupation,BA_average,salary
0,Robert Reid,65,New York,Sub,58,30728
1,Mario Coleman,52,Los Angeles,Advertising account planner,61,7081
2,Tiffany Larsen,40,Houston,Museum education officer,64,37606
3,Noah Bell,86,Houston,Applications developer,65,33167
4,James Miller,84,Boston,Waste management officer,71,34805
5,Mark Johnson,35,Los Angeles,Museum/gallery conservator,72,22149
6,Daniel Juarez,71,Los Angeles,"Teacher, primary school",78,26629
7,Brian Ingram,62,New York,Therapeutic radiographer,88,15097
8,Ronald Miller,38,Los Angeles,"Education officer, community",88,36278
9,Janet Harris MD,82,New York,Set designer,90,10566